## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [31m-[0m destroy[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.aws_iam_policy_document.route53_policy[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "route53_policy" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "route53:ChangeResourceRecordSets",
              [32m+[0m[0m "route53:ListResourceRecordSets",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m (known after apply),
            ]
          [32m+[0m[0m sid       = "UpdateRoutes"
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "route53:GetChange",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "arn:aws:route53:::change/*",
            ]
          [32m+[0m[0m sid       = "GetChange"
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "route53:ListHostedZonesByName",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "ListHostedZones"
        }
    }

[1m  # aws_alb.back-lb[0m will be [1m[31mdestroyed[0m
  # (because aws_alb.back-lb is not in configuration)
[0m  [31m-[0m[0m resource "aws_alb" "back-lb" {
      [31m-[0m[0m arn                                         = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-back-lb/577bc846e7a42d44" [90m-> null[0m[0m
      [31m-[0m[0m arn_suffix                                  = "app/stagnum-back-lb/577bc846e7a42d44" [90m-> null[0m[0m
      [31m-[0m[0m client_keep_alive                           = 3600 [90m-> null[0m[0m
      [31m-[0m[0m desync_mitigation_mode                      = "defensive" [90m-> null[0m[0m
      [31m-[0m[0m dns_name                                    = "stagnum-back-lb-1793228185.eu-north-1.elb.amazonaws.com" [90m-> null[0m[0m
      [31m-[0m[0m drop_invalid_header_fields                  = false [90m-> null[0m[0m
      [31m-[0m[0m enable_cross_zone_load_balancing            = true [90m-> null[0m[0m
      [31m-[0m[0m enable_deletion_protection                  = false [90m-> null[0m[0m
      [31m-[0m[0m enable_http2                                = true [90m-> null[0m[0m
      [31m-[0m[0m enable_tls_version_and_cipher_suite_headers = false [90m-> null[0m[0m
      [31m-[0m[0m enable_waf_fail_open                        = false [90m-> null[0m[0m
      [31m-[0m[0m enable_xff_client_port                      = false [90m-> null[0m[0m
      [31m-[0m[0m id                                          = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-back-lb/577bc846e7a42d44" [90m-> null[0m[0m
      [31m-[0m[0m idle_timeout                                = 60 [90m-> null[0m[0m
      [31m-[0m[0m internal                                    = false [90m-> null[0m[0m
      [31m-[0m[0m ip_address_type                             = "ipv4" [90m-> null[0m[0m
      [31m-[0m[0m load_balancer_type                          = "application" [90m-> null[0m[0m
      [31m-[0m[0m name                                        = "stagnum-back-lb" [90m-> null[0m[0m
      [31m-[0m[0m preserve_host_header                        = false [90m-> null[0m[0m
      [31m-[0m[0m security_groups                             = [
          [31m-[0m[0m "sg-0933e7f0a352c9ba0",
        ] [90m-> null[0m[0m
      [31m-[0m[0m subnets                                     = [
          [31m-[0m[0m "subnet-08d9148bb2f8ed7f7",
          [31m-[0m[0m "subnet-08fd7c14ba8a07d92",
        ] [90m-> null[0m[0m
      [31m-[0m[0m tags                                        = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                                    = {} [90m-> null[0m[0m
      [31m-[0m[0m vpc_id                                      = "vpc-059787243b0515c01" [90m-> null[0m[0m
      [31m-[0m[0m xff_header_processing_mode                  = "append" [90m-> null[0m[0m
      [31m-[0m[0m zone_id                                     = "Z23TAZ6LKFMNIO" [90m-> null[0m[0m

      [31m-[0m[0m access_logs {
          [31m-[0m[0m enabled = false [90m-> null[0m[0m
        }

      [31m-[0m[0m connection_logs {
          [31m-[0m[0m enabled = false [90m-> null[0m[0m
        }

      [31m-[0m[0m subnet_mapping {
          [31m-[0m[0m subnet_id = "subnet-08d9148bb2f8ed7f7" [90m-> null[0m[0m
        }
      [31m-[0m[0m subnet_mapping {
          [31m-[0m[0m subnet_id = "subnet-08fd7c14ba8a07d92" [90m-> null[0m[0m
        }
    }

[1m  # aws_alb.front-lb[0m will be [1m[31mdestroyed[0m
  # (because aws_alb.front-lb is not in configuration)
[0m  [31m-[0m[0m resource "aws_alb" "front-lb" {
      [31m-[0m[0m arn                                         = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-front-lb/ab563dd56f0d527c" [90m-> null[0m[0m
      [31m-[0m[0m arn_suffix                                  = "app/stagnum-front-lb/ab563dd56f0d527c" [90m-> null[0m[0m
      [31m-[0m[0m client_keep_alive                           = 3600 [90m-> null[0m[0m
      [31m-[0m[0m desync_mitigation_mode                      = "defensive" [90m-> null[0m[0m
      [31m-[0m[0m dns_name                                    = "stagnum-front-lb-281869962.eu-north-1.elb.amazonaws.com" [90m-> null[0m[0m
      [31m-[0m[0m drop_invalid_header_fields                  = false [90m-> null[0m[0m
      [31m-[0m[0m enable_cross_zone_load_balancing            = true [90m-> null[0m[0m
      [31m-[0m[0m enable_deletion_protection                  = false [90m-> null[0m[0m
      [31m-[0m[0m enable_http2                                = true [90m-> null[0m[0m
      [31m-[0m[0m enable_tls_version_and_cipher_suite_headers = false [90m-> null[0m[0m
      [31m-[0m[0m enable_waf_fail_open                        = false [90m-> null[0m[0m
      [31m-[0m[0m enable_xff_client_port                      = false [90m-> null[0m[0m
      [31m-[0m[0m id                                          = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-front-lb/ab563dd56f0d527c" [90m-> null[0m[0m
      [31m-[0m[0m idle_timeout                                = 60 [90m-> null[0m[0m
      [31m-[0m[0m internal                                    = false [90m-> null[0m[0m
      [31m-[0m[0m ip_address_type                             = "ipv4" [90m-> null[0m[0m
      [31m-[0m[0m load_balancer_type                          = "application" [90m-> null[0m[0m
      [31m-[0m[0m name                                        = "stagnum-front-lb" [90m-> null[0m[0m
      [31m-[0m[0m preserve_host_header                        = false [90m-> null[0m[0m
      [31m-[0m[0m security_groups                             = [
          [31m-[0m[0m "sg-0933e7f0a352c9ba0",
        ] [90m-> null[0m[0m
      [31m-[0m[0m subnets                                     = [
          [31m-[0m[0m "subnet-08d9148bb2f8ed7f7",
          [31m-[0m[0m "subnet-08fd7c14ba8a07d92",
        ] [90m-> null[0m[0m
      [31m-[0m[0m tags                                        = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                                    = {} [90m-> null[0m[0m
      [31m-[0m[0m vpc_id                                      = "vpc-059787243b0515c01" [90m-> null[0m[0m
      [31m-[0m[0m xff_header_processing_mode                  = "append" [90m-> null[0m[0m
      [31m-[0m[0m zone_id                                     = "Z23TAZ6LKFMNIO" [90m-> null[0m[0m

      [31m-[0m[0m access_logs {
          [31m-[0m[0m enabled = false [90m-> null[0m[0m
        }

      [31m-[0m[0m connection_logs {
          [31m-[0m[0m enabled = false [90m-> null[0m[0m
        }

      [31m-[0m[0m subnet_mapping {
          [31m-[0m[0m subnet_id = "subnet-08d9148bb2f8ed7f7" [90m-> null[0m[0m
        }
      [31m-[0m[0m subnet_mapping {
          [31m-[0m[0m subnet_id = "subnet-08fd7c14ba8a07d92" [90m-> null[0m[0m
        }
    }

[1m  # aws_cloudwatch_log_group.log-group[0m will be [1m[31mdestroyed[0m
  # (because aws_cloudwatch_log_group.log-group is not in configuration)
[0m  [31m-[0m[0m resource "aws_cloudwatch_log_group" "log-group" {
      [31m-[0m[0m arn               = "arn:aws:logs:eu-north-1:851725292587:log-group:stagnum-logs" [90m-> null[0m[0m
      [31m-[0m[0m id                = "stagnum-logs" [90m-> null[0m[0m
      [31m-[0m[0m log_group_class   = "STANDARD" [90m-> null[0m[0m
      [31m-[0m[0m name              = "stagnum-logs" [90m-> null[0m[0m
      [31m-[0m[0m retention_in_days = 0 [90m-> null[0m[0m
      [31m-[0m[0m skip_destroy      = false [90m-> null[0m[0m
      [31m-[0m[0m tags              = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all          = {} [90m-> null[0m[0m
    }

[1m  # aws_default_subnet.default_subnet_a[0m will be [1m[31mdestroyed[0m
  # (because aws_default_subnet.default_subnet_a is not in configuration)
[0m  [31m-[0m[0m resource "aws_default_subnet" "default_subnet_a" {
      [31m-[0m[0m arn                                            = "arn:aws:ec2:eu-north-1:851725292587:subnet/subnet-08fd7c14ba8a07d92" [90m-> null[0m[0m
      [31m-[0m[0m assign_ipv6_address_on_creation                = false [90m-> null[0m[0m
      [31m-[0m[0m availability_zone                              = "eu-north-1a" [90m-> null[0m[0m
      [31m-[0m[0m availability_zone_id                           = "eun1-az1" [90m-> null[0m[0m
      [31m-[0m[0m cidr_block                                     = "172.31.16.0/20" [90m-> null[0m[0m
      [31m-[0m[0m enable_dns64                                   = false [90m-> null[0m[0m
      [31m-[0m[0m enable_lni_at_device_index                     = 0 [90m-> null[0m[0m
      [31m-[0m[0m enable_resource_name_dns_a_record_on_launch    = false [90m-> null[0m[0m
      [31m-[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false [90m-> null[0m[0m
      [31m-[0m[0m existing_default_subnet                        = true [90m-> null[0m[0m
      [31m-[0m[0m force_destroy                                  = false [90m-> null[0m[0m
      [31m-[0m[0m id                                             = "subnet-08fd7c14ba8a07d92" [90m-> null[0m[0m
      [31m-[0m[0m ipv6_native                                    = false [90m-> null[0m[0m
      [31m-[0m[0m map_customer_owned_ip_on_launch                = false [90m-> null[0m[0m
      [31m-[0m[0m map_public_ip_on_launch                        = true [90m-> null[0m[0m
      [31m-[0m[0m owner_id                                       = "851725292587" [90m-> null[0m[0m
      [31m-[0m[0m private_dns_hostname_type_on_launch            = "ip-name" [90m-> null[0m[0m
      [31m-[0m[0m tags                                           = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                                       = {} [90m-> null[0m[0m
      [31m-[0m[0m vpc_id                                         = "vpc-059787243b0515c01" [90m-> null[0m[0m
    }

[1m  # aws_default_subnet.default_subnet_b[0m will be [1m[31mdestroyed[0m
  # (because aws_default_subnet.default_subnet_b is not in configuration)
[0m  [31m-[0m[0m resource "aws_default_subnet" "default_subnet_b" {
      [31m-[0m[0m arn                                            = "arn:aws:ec2:eu-north-1:851725292587:subnet/subnet-08d9148bb2f8ed7f7" [90m-> null[0m[0m
      [31m-[0m[0m assign_ipv6_address_on_creation                = false [90m-> null[0m[0m
      [31m-[0m[0m availability_zone                              = "eu-north-1b" [90m-> null[0m[0m
      [31m-[0m[0m availability_zone_id                           = "eun1-az2" [90m-> null[0m[0m
      [31m-[0m[0m cidr_block                                     = "172.31.32.0/20" [90m-> null[0m[0m
      [31m-[0m[0m enable_dns64                                   = false [90m-> null[0m[0m
      [31m-[0m[0m enable_lni_at_device_index                     = 0 [90m-> null[0m[0m
      [31m-[0m[0m enable_resource_name_dns_a_record_on_launch    = false [90m-> null[0m[0m
      [31m-[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false [90m-> null[0m[0m
      [31m-[0m[0m existing_default_subnet                        = true [90m-> null[0m[0m
      [31m-[0m[0m force_destroy                                  = false [90m-> null[0m[0m
      [31m-[0m[0m id                                             = "subnet-08d9148bb2f8ed7f7" [90m-> null[0m[0m
      [31m-[0m[0m ipv6_native                                    = false [90m-> null[0m[0m
      [31m-[0m[0m map_customer_owned_ip_on_launch                = false [90m-> null[0m[0m
      [31m-[0m[0m map_public_ip_on_launch                        = true [90m-> null[0m[0m
      [31m-[0m[0m owner_id                                       = "851725292587" [90m-> null[0m[0m
      [31m-[0m[0m private_dns_hostname_type_on_launch            = "ip-name" [90m-> null[0m[0m
      [31m-[0m[0m tags                                           = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                                       = {} [90m-> null[0m[0m
      [31m-[0m[0m vpc_id                                         = "vpc-059787243b0515c01" [90m-> null[0m[0m
    }

[1m  # aws_default_vpc.default_vpc[0m will be [1m[31mdestroyed[0m
  # (because aws_default_vpc.default_vpc is not in configuration)
[0m  [31m-[0m[0m resource "aws_default_vpc" "default_vpc" {
      [31m-[0m[0m arn                                  = "arn:aws:ec2:eu-north-1:851725292587:vpc/vpc-059787243b0515c01" [90m-> null[0m[0m
      [31m-[0m[0m assign_generated_ipv6_cidr_block     = false [90m-> null[0m[0m
      [31m-[0m[0m cidr_block                           = "172.31.0.0/16" [90m-> null[0m[0m
      [31m-[0m[0m default_network_acl_id               = "acl-0499aa6533bd5de23" [90m-> null[0m[0m
      [31m-[0m[0m default_route_table_id               = "rtb-0e8924ceb8507f7c2" [90m-> null[0m[0m
      [31m-[0m[0m default_security_group_id            = "sg-0532aa978471f603e" [90m-> null[0m[0m
      [31m-[0m[0m dhcp_options_id                      = "dopt-0fff3f822a06bca4c" [90m-> null[0m[0m
      [31m-[0m[0m enable_dns_hostnames                 = true [90m-> null[0m[0m
      [31m-[0m[0m enable_dns_support                   = true [90m-> null[0m[0m
      [31m-[0m[0m enable_network_address_usage_metrics = false [90m-> null[0m[0m
      [31m-[0m[0m existing_default_vpc                 = true [90m-> null[0m[0m
      [31m-[0m[0m force_destroy                        = false [90m-> null[0m[0m
      [31m-[0m[0m id                                   = "vpc-059787243b0515c01" [90m-> null[0m[0m
      [31m-[0m[0m instance_tenancy                     = "default" [90m-> null[0m[0m
      [31m-[0m[0m ipv6_netmask_length                  = 0 [90m-> null[0m[0m
      [31m-[0m[0m main_route_table_id                  = "rtb-0e8924ceb8507f7c2" [90m-> null[0m[0m
      [31m-[0m[0m owner_id                             = "851725292587" [90m-> null[0m[0m
      [31m-[0m[0m tags                                 = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                             = {} [90m-> null[0m[0m
    }

[1m  # aws_ebs_volume.posrgres[0m will be created
[0m  [32m+[0m[0m resource "aws_ebs_volume" "posrgres" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m availability_zone = "eu-north-1a"
      [32m+[0m[0m encrypted         = (known after apply)
      [32m+[0m[0m final_snapshot    = false
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m iops              = (known after apply)
      [32m+[0m[0m kms_key_id        = (known after apply)
      [32m+[0m[0m size              = 10
      [32m+[0m[0m snapshot_id       = (known after apply)
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-postgers"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-postgers"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m throughput        = (known after apply)
      [32m+[0m[0m type              = "gp3"
    }

[1m  # aws_ecs_cluster.aws-cluster[0m will be [1m[31mdestroyed[0m
  # (because aws_ecs_cluster.aws-cluster is not in configuration)
[0m  [31m-[0m[0m resource "aws_ecs_cluster" "aws-cluster" {
      [31m-[0m[0m arn      = "arn:aws:ecs:eu-north-1:851725292587:cluster/stagnum-cluster" [90m-> null[0m[0m
      [31m-[0m[0m id       = "arn:aws:ecs:eu-north-1:851725292587:cluster/stagnum-cluster" [90m-> null[0m[0m
      [31m-[0m[0m name     = "stagnum-cluster" [90m-> null[0m[0m
      [31m-[0m[0m tags     = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all = {} [90m-> null[0m[0m

      [31m-[0m[0m configuration {
          [31m-[0m[0m execute_command_configuration {
              [31m-[0m[0m kms_key_id = "arn:aws:kms:eu-north-1:851725292587:key/60118a5f-9f2f-4ef1-a690-31b80762a8a9" [90m-> null[0m[0m
              [31m-[0m[0m logging    = "OVERRIDE" [90m-> null[0m[0m

              [31m-[0m[0m log_configuration {
                  [31m-[0m[0m cloud_watch_encryption_enabled = true [90m-> null[0m[0m
                  [31m-[0m[0m cloud_watch_log_group_name     = "stagnum-logs" [90m-> null[0m[0m
                  [31m-[0m[0m s3_bucket_encryption_enabled   = false [90m-> null[0m[0m
                }
            }
        }
    }

[1m  # aws_ecs_service.stagnum-back-service[0m will be [1m[31mdestroyed[0m
  # (because aws_ecs_service.stagnum-back-service is not in configuration)
[0m  [31m-[0m[0m resource "aws_ecs_service" "stagnum-back-service" {
      [31m-[0m[0m cluster                            = "arn:aws:ecs:eu-north-1:851725292587:cluster/stagnum-cluster" [90m-> null[0m[0m
      [31m-[0m[0m deployment_maximum_percent         = 200 [90m-> null[0m[0m
      [31m-[0m[0m deployment_minimum_healthy_percent = 100 [90m-> null[0m[0m
      [31m-[0m[0m desired_count                      = 1 [90m-> null[0m[0m
      [31m-[0m[0m enable_ecs_managed_tags            = false [90m-> null[0m[0m
      [31m-[0m[0m enable_execute_command             = false [90m-> null[0m[0m
      [31m-[0m[0m health_check_grace_period_seconds  = 0 [90m-> null[0m[0m
      [31m-[0m[0m iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" [90m-> null[0m[0m
      [31m-[0m[0m id                                 = "arn:aws:ecs:eu-north-1:851725292587:service/stagnum-cluster/stagnum-back-service" [90m-> null[0m[0m
      [31m-[0m[0m launch_type                        = "FARGATE" [90m-> null[0m[0m
      [31m-[0m[0m name                               = "stagnum-back-service" [90m-> null[0m[0m
      [31m-[0m[0m platform_version                   = "LATEST" [90m-> null[0m[0m
      [31m-[0m[0m propagate_tags                     = "NONE" [90m-> null[0m[0m
      [31m-[0m[0m scheduling_strategy                = "REPLICA" [90m-> null[0m[0m
      [31m-[0m[0m tags                               = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                           = {} [90m-> null[0m[0m
      [31m-[0m[0m task_definition                    = "arn:aws:ecs:eu-north-1:851725292587:task-definition/stagnum-back-task:2" [90m-> null[0m[0m
      [31m-[0m[0m triggers                           = {} [90m-> null[0m[0m
      [31m-[0m[0m wait_for_steady_state              = false [90m-> null[0m[0m

      [31m-[0m[0m deployment_circuit_breaker {
          [31m-[0m[0m enable   = false [90m-> null[0m[0m
          [31m-[0m[0m rollback = false [90m-> null[0m[0m
        }

      [31m-[0m[0m deployment_controller {
          [31m-[0m[0m type = "ECS" [90m-> null[0m[0m
        }

      [31m-[0m[0m load_balancer {
          [31m-[0m[0m container_name   = "stagnum-back-container" [90m-> null[0m[0m
          [31m-[0m[0m container_port   = 8080 [90m-> null[0m[0m
          [31m-[0m[0m target_group_arn = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/back-target-group/4617b821fdf233cd" [90m-> null[0m[0m
        }

      [31m-[0m[0m network_configuration {
          [31m-[0m[0m assign_public_ip = true [90m-> null[0m[0m
          [31m-[0m[0m security_groups  = [
              [31m-[0m[0m "sg-0a133d706c3dfec36",
            ] [90m-> null[0m[0m
          [31m-[0m[0m subnets          = [
              [31m-[0m[0m "subnet-08d9148bb2f8ed7f7",
              [31m-[0m[0m "subnet-08fd7c14ba8a07d92",
            ] [90m-> null[0m[0m
        }
    }

[1m  # aws_ecs_service.stagnum-front-service[0m will be [1m[31mdestroyed[0m
  # (because aws_ecs_service.stagnum-front-service is not in configuration)
[0m  [31m-[0m[0m resource "aws_ecs_service" "stagnum-front-service" {
      [31m-[0m[0m cluster                            = "arn:aws:ecs:eu-north-1:851725292587:cluster/stagnum-cluster" [90m-> null[0m[0m
      [31m-[0m[0m deployment_maximum_percent         = 200 [90m-> null[0m[0m
      [31m-[0m[0m deployment_minimum_healthy_percent = 100 [90m-> null[0m[0m
      [31m-[0m[0m desired_count                      = 1 [90m-> null[0m[0m
      [31m-[0m[0m enable_ecs_managed_tags            = false [90m-> null[0m[0m
      [31m-[0m[0m enable_execute_command             = false [90m-> null[0m[0m
      [31m-[0m[0m health_check_grace_period_seconds  = 0 [90m-> null[0m[0m
      [31m-[0m[0m iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" [90m-> null[0m[0m
      [31m-[0m[0m id                                 = "arn:aws:ecs:eu-north-1:851725292587:service/stagnum-cluster/stagnum-front-service" [90m-> null[0m[0m
      [31m-[0m[0m launch_type                        = "FARGATE" [90m-> null[0m[0m
      [31m-[0m[0m name                               = "stagnum-front-service" [90m-> null[0m[0m
      [31m-[0m[0m platform_version                   = "LATEST" [90m-> null[0m[0m
      [31m-[0m[0m propagate_tags                     = "NONE" [90m-> null[0m[0m
      [31m-[0m[0m scheduling_strategy                = "REPLICA" [90m-> null[0m[0m
      [31m-[0m[0m tags                               = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                           = {} [90m-> null[0m[0m
      [31m-[0m[0m task_definition                    = "arn:aws:ecs:eu-north-1:851725292587:task-definition/stagnum-front-task:2" [90m-> null[0m[0m
      [31m-[0m[0m triggers                           = {} [90m-> null[0m[0m
      [31m-[0m[0m wait_for_steady_state              = false [90m-> null[0m[0m

      [31m-[0m[0m deployment_circuit_breaker {
          [31m-[0m[0m enable   = false [90m-> null[0m[0m
          [31m-[0m[0m rollback = false [90m-> null[0m[0m
        }

      [31m-[0m[0m deployment_controller {
          [31m-[0m[0m type = "ECS" [90m-> null[0m[0m
        }

      [31m-[0m[0m load_balancer {
          [31m-[0m[0m container_name   = "stagnum-front-container" [90m-> null[0m[0m
          [31m-[0m[0m container_port   = 3000 [90m-> null[0m[0m
          [31m-[0m[0m target_group_arn = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/front-target-group/65aeaa00a8d33a5e" [90m-> null[0m[0m
        }

      [31m-[0m[0m network_configuration {
          [31m-[0m[0m assign_public_ip = true [90m-> null[0m[0m
          [31m-[0m[0m security_groups  = [
              [31m-[0m[0m "sg-0a133d706c3dfec36",
            ] [90m-> null[0m[0m
          [31m-[0m[0m subnets          = [
              [31m-[0m[0m "subnet-08d9148bb2f8ed7f7",
              [31m-[0m[0m "subnet-08fd7c14ba8a07d92",
            ] [90m-> null[0m[0m
        }
    }

[1m  # aws_ecs_task_definition.back-task[0m will be [1m[31mdestroyed[0m
  # (because aws_ecs_task_definition.back-task is not in configuration)
[0m  [31m-[0m[0m resource "aws_ecs_task_definition" "back-task" {
      [31m-[0m[0m arn                      = "arn:aws:ecs:eu-north-1:851725292587:task-definition/stagnum-back-task:2" [90m-> null[0m[0m
      [31m-[0m[0m arn_without_revision     = "arn:aws:ecs:eu-north-1:851725292587:task-definition/stagnum-back-task" [90m-> null[0m[0m
      [31m-[0m[0m container_definitions    = (sensitive value) [90m-> null[0m[0m
      [31m-[0m[0m cpu                      = "256" [90m-> null[0m[0m
      [31m-[0m[0m execution_role_arn       = "arn:aws:iam::851725292587:role/ecsTaskExecutionRole" [90m-> null[0m[0m
      [31m-[0m[0m family                   = "stagnum-back-task" [90m-> null[0m[0m
      [31m-[0m[0m id                       = "stagnum-back-task" [90m-> null[0m[0m
      [31m-[0m[0m memory                   = "512" [90m-> null[0m[0m
      [31m-[0m[0m network_mode             = "awsvpc" [90m-> null[0m[0m
      [31m-[0m[0m requires_compatibilities = [
          [31m-[0m[0m "FARGATE",
        ] [90m-> null[0m[0m
      [31m-[0m[0m revision                 = 2 [90m-> null[0m[0m
      [31m-[0m[0m skip_destroy             = false [90m-> null[0m[0m
      [31m-[0m[0m tags                     = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                 = {} [90m-> null[0m[0m
      [31m-[0m[0m track_latest             = false [90m-> null[0m[0m
    }

[1m  # aws_ecs_task_definition.front-task[0m will be [1m[31mdestroyed[0m
  # (because aws_ecs_task_definition.front-task is not in configuration)
[0m  [31m-[0m[0m resource "aws_ecs_task_definition" "front-task" {
      [31m-[0m[0m arn                      = "arn:aws:ecs:eu-north-1:851725292587:task-definition/stagnum-front-task:2" [90m-> null[0m[0m
      [31m-[0m[0m arn_without_revision     = "arn:aws:ecs:eu-north-1:851725292587:task-definition/stagnum-front-task" [90m-> null[0m[0m
      [31m-[0m[0m container_definitions    = jsonencode(
            [
              [31m-[0m[0m {
                  [31m-[0m[0m cpu              = 0
                  [31m-[0m[0m environment      = [
                      [31m-[0m[0m {
                          [31m-[0m[0m name  = "NEXT_PUBLIC_BACKEND_URI"
                          [31m-[0m[0m value = "http://stagnum-back-lb-1793228185.eu-north-1.elb.amazonaws.com"
                        },
                      [31m-[0m[0m {
                          [31m-[0m[0m name  = "NEXT_PUBLIC_FRONTEND_URI"
                          [31m-[0m[0m value = "http://stagnum-front-lb-281869962.eu-north-1.elb.amazonaws.com"
                        },
                    ]
                  [31m-[0m[0m essential        = true
                  [31m-[0m[0m image            = "eddiethecubehead/stagnum_client:master"
                  [31m-[0m[0m logConfiguration = {
                      [31m-[0m[0m logDriver = "awslogs"
                      [31m-[0m[0m options   = {
                          [31m-[0m[0m awslogs-create-group  = "true"
                          [31m-[0m[0m awslogs-group         = "stagnum-logs"
                          [31m-[0m[0m awslogs-region        = "eu-north-1"
                          [31m-[0m[0m awslogs-stream-prefix = "stagnum"
                        }
                    }
                  [31m-[0m[0m mountPoints      = []
                  [31m-[0m[0m name             = "stagnum-front-container"
                  [31m-[0m[0m portMappings     = [
                      [31m-[0m[0m {
                          [31m-[0m[0m containerPort = 3000
                          [31m-[0m[0m hostPort      = 3000
                          [31m-[0m[0m protocol      = "tcp"
                        },
                    ]
                  [31m-[0m[0m systemControls   = []
                  [31m-[0m[0m volumesFrom      = []
                },
            ]
        ) [90m-> null[0m[0m
      [31m-[0m[0m cpu                      = "256" [90m-> null[0m[0m
      [31m-[0m[0m execution_role_arn       = "arn:aws:iam::851725292587:role/ecsTaskExecutionRole" [90m-> null[0m[0m
      [31m-[0m[0m family                   = "stagnum-front-task" [90m-> null[0m[0m
      [31m-[0m[0m id                       = "stagnum-front-task" [90m-> null[0m[0m
      [31m-[0m[0m memory                   = "512" [90m-> null[0m[0m
      [31m-[0m[0m network_mode             = "awsvpc" [90m-> null[0m[0m
      [31m-[0m[0m requires_compatibilities = [
          [31m-[0m[0m "FARGATE",
        ] [90m-> null[0m[0m
      [31m-[0m[0m revision                 = 2 [90m-> null[0m[0m
      [31m-[0m[0m skip_destroy             = false [90m-> null[0m[0m
      [31m-[0m[0m tags                     = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                 = {} [90m-> null[0m[0m
      [31m-[0m[0m track_latest             = false [90m-> null[0m[0m
    }

[1m  # aws_iam_role.ecsTaskExecutionRole[0m will be [1m[31mdestroyed[0m
  # (because aws_iam_role.ecsTaskExecutionRole is not in configuration)
[0m  [31m-[0m[0m resource "aws_iam_role" "ecsTaskExecutionRole" {
      [31m-[0m[0m arn                   = "arn:aws:iam::851725292587:role/ecsTaskExecutionRole" [90m-> null[0m[0m
      [31m-[0m[0m assume_role_policy    = jsonencode(
            {
              [31m-[0m[0m Statement = [
                  [31m-[0m[0m {
                      [31m-[0m[0m Action    = "sts:AssumeRole"
                      [31m-[0m[0m Effect    = "Allow"
                      [31m-[0m[0m Principal = {
                          [31m-[0m[0m Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              [31m-[0m[0m Version   = "2012-10-17"
            }
        ) [90m-> null[0m[0m
      [31m-[0m[0m create_date           = "2024-04-15T21:02:58Z" [90m-> null[0m[0m
      [31m-[0m[0m force_detach_policies = false [90m-> null[0m[0m
      [31m-[0m[0m id                    = "ecsTaskExecutionRole" [90m-> null[0m[0m
      [31m-[0m[0m managed_policy_arns   = [
          [31m-[0m[0m "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] [90m-> null[0m[0m
      [31m-[0m[0m max_session_duration  = 3600 [90m-> null[0m[0m
      [31m-[0m[0m name                  = "ecsTaskExecutionRole" [90m-> null[0m[0m
      [31m-[0m[0m path                  = "/" [90m-> null[0m[0m
      [31m-[0m[0m tags                  = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all              = {} [90m-> null[0m[0m
      [31m-[0m[0m unique_id             = "AROA4MTWISQVRIRBGEL72" [90m-> null[0m[0m
    }

[1m  # aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy[0m will be [1m[31mdestroyed[0m
  # (because aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy is not in configuration)
[0m  [31m-[0m[0m resource "aws_iam_role_policy_attachment" "ecsTaskExecutionRole_policy" {
      [31m-[0m[0m id         = "ecsTaskExecutionRole-20240415210258547000000002" [90m-> null[0m[0m
      [31m-[0m[0m policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" [90m-> null[0m[0m
      [31m-[0m[0m role       = "ecsTaskExecutionRole" [90m-> null[0m[0m
    }

[1m  # aws_key_pair.deployer[0m will be created
[0m  [32m+[0m[0m resource "aws_key_pair" "deployer" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m fingerprint     = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m key_name        = "deployer-key"
      [32m+[0m[0m key_name_prefix = (known after apply)
      [32m+[0m[0m key_pair_id     = (known after apply)
      [32m+[0m[0m key_type        = (known after apply)
      [32m+[0m[0m public_key      = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOgP6TjSCjZS/VWhixYYevHGdzVN4jmlT5KH9va5CiBs elias.samuli@gmail.com"
      [32m+[0m[0m tags_all        = (known after apply)
    }

[1m  # aws_kms_key.stagnum[0m will be [1m[31mdestroyed[0m
  # (because aws_kms_key.stagnum is not in configuration)
[0m  [31m-[0m[0m resource "aws_kms_key" "stagnum" {
      [31m-[0m[0m arn                                = "arn:aws:kms:eu-north-1:851725292587:key/60118a5f-9f2f-4ef1-a690-31b80762a8a9" [90m-> null[0m[0m
      [31m-[0m[0m bypass_policy_lockout_safety_check = false [90m-> null[0m[0m
      [31m-[0m[0m customer_master_key_spec           = "SYMMETRIC_DEFAULT" [90m-> null[0m[0m
      [31m-[0m[0m deletion_window_in_days            = 7 [90m-> null[0m[0m
      [31m-[0m[0m description                        = "stagnum" [90m-> null[0m[0m
      [31m-[0m[0m enable_key_rotation                = false [90m-> null[0m[0m
      [31m-[0m[0m id                                 = "60118a5f-9f2f-4ef1-a690-31b80762a8a9" [90m-> null[0m[0m
      [31m-[0m[0m is_enabled                         = true [90m-> null[0m[0m
      [31m-[0m[0m key_id                             = "60118a5f-9f2f-4ef1-a690-31b80762a8a9" [90m-> null[0m[0m
      [31m-[0m[0m key_usage                          = "ENCRYPT_DECRYPT" [90m-> null[0m[0m
      [31m-[0m[0m multi_region                       = false [90m-> null[0m[0m
      [31m-[0m[0m policy                             = jsonencode(
            {
              [31m-[0m[0m Id        = "key-default-1"
              [31m-[0m[0m Statement = [
                  [31m-[0m[0m {
                      [31m-[0m[0m Action    = "kms:*"
                      [31m-[0m[0m Effect    = "Allow"
                      [31m-[0m[0m Principal = {
                          [31m-[0m[0m AWS = "arn:aws:iam::851725292587:root"
                        }
                      [31m-[0m[0m Resource  = "*"
                      [31m-[0m[0m Sid       = "Enable IAM User Permissions"
                    },
                ]
              [31m-[0m[0m Version   = "2012-10-17"
            }
        ) [90m-> null[0m[0m
      [31m-[0m[0m rotation_period_in_days            = 0 [90m-> null[0m[0m
      [31m-[0m[0m tags                               = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                           = {} [90m-> null[0m[0m
    }

[1m  # aws_lb_listener.client-listener[0m will be [1m[31mdestroyed[0m
  # (because aws_lb_listener.client-listener is not in configuration)
[0m  [31m-[0m[0m resource "aws_lb_listener" "client-listener" {
      [31m-[0m[0m arn               = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:listener/app/stagnum-front-lb/ab563dd56f0d527c/247e82bce58ead86" [90m-> null[0m[0m
      [31m-[0m[0m id                = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:listener/app/stagnum-front-lb/ab563dd56f0d527c/247e82bce58ead86" [90m-> null[0m[0m
      [31m-[0m[0m load_balancer_arn = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-front-lb/ab563dd56f0d527c" [90m-> null[0m[0m
      [31m-[0m[0m port              = 80 [90m-> null[0m[0m
      [31m-[0m[0m protocol          = "HTTP" [90m-> null[0m[0m
      [31m-[0m[0m tags              = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all          = {} [90m-> null[0m[0m

      [31m-[0m[0m default_action {
          [31m-[0m[0m order            = 1 [90m-> null[0m[0m
          [31m-[0m[0m target_group_arn = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/front-target-group/65aeaa00a8d33a5e" [90m-> null[0m[0m
          [31m-[0m[0m type             = "forward" [90m-> null[0m[0m
        }
    }

[1m  # aws_lb_listener.server-listener[0m will be [1m[31mdestroyed[0m
  # (because aws_lb_listener.server-listener is not in configuration)
[0m  [31m-[0m[0m resource "aws_lb_listener" "server-listener" {
      [31m-[0m[0m arn               = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:listener/app/stagnum-back-lb/577bc846e7a42d44/a51e31248fc69ded" [90m-> null[0m[0m
      [31m-[0m[0m id                = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:listener/app/stagnum-back-lb/577bc846e7a42d44/a51e31248fc69ded" [90m-> null[0m[0m
      [31m-[0m[0m load_balancer_arn = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-back-lb/577bc846e7a42d44" [90m-> null[0m[0m
      [31m-[0m[0m port              = 80 [90m-> null[0m[0m
      [31m-[0m[0m protocol          = "HTTP" [90m-> null[0m[0m
      [31m-[0m[0m tags              = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all          = {} [90m-> null[0m[0m

      [31m-[0m[0m default_action {
          [31m-[0m[0m order            = 1 [90m-> null[0m[0m
          [31m-[0m[0m target_group_arn = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/back-target-group/4617b821fdf233cd" [90m-> null[0m[0m
          [31m-[0m[0m type             = "forward" [90m-> null[0m[0m
        }
    }

[1m  # aws_lb_target_group.back-target-group[0m will be [1m[31mdestroyed[0m
  # (because aws_lb_target_group.back-target-group is not in configuration)
[0m  [31m-[0m[0m resource "aws_lb_target_group" "back-target-group" {
      [31m-[0m[0m arn                                = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/back-target-group/4617b821fdf233cd" [90m-> null[0m[0m
      [31m-[0m[0m arn_suffix                         = "targetgroup/back-target-group/4617b821fdf233cd" [90m-> null[0m[0m
      [31m-[0m[0m deregistration_delay               = "300" [90m-> null[0m[0m
      [31m-[0m[0m id                                 = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/back-target-group/4617b821fdf233cd" [90m-> null[0m[0m
      [31m-[0m[0m ip_address_type                    = "ipv4" [90m-> null[0m[0m
      [31m-[0m[0m lambda_multi_value_headers_enabled = false [90m-> null[0m[0m
      [31m-[0m[0m load_balancer_arns                 = [
          [31m-[0m[0m "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-back-lb/577bc846e7a42d44",
        ] [90m-> null[0m[0m
      [31m-[0m[0m load_balancing_algorithm_type      = "round_robin" [90m-> null[0m[0m
      [31m-[0m[0m load_balancing_anomaly_mitigation  = "off" [90m-> null[0m[0m
      [31m-[0m[0m load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" [90m-> null[0m[0m
      [31m-[0m[0m name                               = "back-target-group" [90m-> null[0m[0m
      [31m-[0m[0m port                               = 80 [90m-> null[0m[0m
      [31m-[0m[0m protocol                           = "HTTP" [90m-> null[0m[0m
      [31m-[0m[0m protocol_version                   = "HTTP1" [90m-> null[0m[0m
      [31m-[0m[0m proxy_protocol_v2                  = false [90m-> null[0m[0m
      [31m-[0m[0m slow_start                         = 0 [90m-> null[0m[0m
      [31m-[0m[0m tags                               = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                           = {} [90m-> null[0m[0m
      [31m-[0m[0m target_type                        = "ip" [90m-> null[0m[0m
      [31m-[0m[0m vpc_id                             = "vpc-059787243b0515c01" [90m-> null[0m[0m

      [31m-[0m[0m health_check {
          [31m-[0m[0m enabled             = true [90m-> null[0m[0m
          [31m-[0m[0m healthy_threshold   = 5 [90m-> null[0m[0m
          [31m-[0m[0m interval            = 60 [90m-> null[0m[0m
          [31m-[0m[0m matcher             = "200-399" [90m-> null[0m[0m
          [31m-[0m[0m path                = "/" [90m-> null[0m[0m
          [31m-[0m[0m port                = "traffic-port" [90m-> null[0m[0m
          [31m-[0m[0m protocol            = "HTTP" [90m-> null[0m[0m
          [31m-[0m[0m timeout             = 10 [90m-> null[0m[0m
          [31m-[0m[0m unhealthy_threshold = 5 [90m-> null[0m[0m
        }

      [31m-[0m[0m stickiness {
          [31m-[0m[0m cookie_duration = 86400 [90m-> null[0m[0m
          [31m-[0m[0m enabled         = false [90m-> null[0m[0m
          [31m-[0m[0m type            = "lb_cookie" [90m-> null[0m[0m
        }

      [31m-[0m[0m target_failover {}

      [31m-[0m[0m target_health_state {}
    }

[1m  # aws_lb_target_group.front-target-group[0m will be [1m[31mdestroyed[0m
  # (because aws_lb_target_group.front-target-group is not in configuration)
[0m  [31m-[0m[0m resource "aws_lb_target_group" "front-target-group" {
      [31m-[0m[0m arn                                = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/front-target-group/65aeaa00a8d33a5e" [90m-> null[0m[0m
      [31m-[0m[0m arn_suffix                         = "targetgroup/front-target-group/65aeaa00a8d33a5e" [90m-> null[0m[0m
      [31m-[0m[0m deregistration_delay               = "300" [90m-> null[0m[0m
      [31m-[0m[0m id                                 = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/front-target-group/65aeaa00a8d33a5e" [90m-> null[0m[0m
      [31m-[0m[0m ip_address_type                    = "ipv4" [90m-> null[0m[0m
      [31m-[0m[0m lambda_multi_value_headers_enabled = false [90m-> null[0m[0m
      [31m-[0m[0m load_balancer_arns                 = [
          [31m-[0m[0m "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-front-lb/ab563dd56f0d527c",
        ] [90m-> null[0m[0m
      [31m-[0m[0m load_balancing_algorithm_type      = "round_robin" [90m-> null[0m[0m
      [31m-[0m[0m load_balancing_anomaly_mitigation  = "off" [90m-> null[0m[0m
      [31m-[0m[0m load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" [90m-> null[0m[0m
      [31m-[0m[0m name                               = "front-target-group" [90m-> null[0m[0m
      [31m-[0m[0m port                               = 80 [90m-> null[0m[0m
      [31m-[0m[0m protocol                           = "HTTP" [90m-> null[0m[0m
      [31m-[0m[0m protocol_version                   = "HTTP1" [90m-> null[0m[0m
      [31m-[0m[0m proxy_protocol_v2                  = false [90m-> null[0m[0m
      [31m-[0m[0m slow_start                         = 0 [90m-> null[0m[0m
      [31m-[0m[0m tags                               = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                           = {} [90m-> null[0m[0m
      [31m-[0m[0m target_type                        = "ip" [90m-> null[0m[0m
      [31m-[0m[0m vpc_id                             = "vpc-059787243b0515c01" [90m-> null[0m[0m

      [31m-[0m[0m health_check {
          [31m-[0m[0m enabled             = true [90m-> null[0m[0m
          [31m-[0m[0m healthy_threshold   = 5 [90m-> null[0m[0m
          [31m-[0m[0m interval            = 60 [90m-> null[0m[0m
          [31m-[0m[0m matcher             = "200-399" [90m-> null[0m[0m
          [31m-[0m[0m path                = "/" [90m-> null[0m[0m
          [31m-[0m[0m port                = "traffic-port" [90m-> null[0m[0m
          [31m-[0m[0m protocol            = "HTTP" [90m-> null[0m[0m
          [31m-[0m[0m timeout             = 10 [90m-> null[0m[0m
          [31m-[0m[0m unhealthy_threshold = 5 [90m-> null[0m[0m
        }

      [31m-[0m[0m stickiness {
          [31m-[0m[0m cookie_duration = 86400 [90m-> null[0m[0m
          [31m-[0m[0m enabled         = false [90m-> null[0m[0m
          [31m-[0m[0m type            = "lb_cookie" [90m-> null[0m[0m
        }

      [31m-[0m[0m target_failover {}

      [31m-[0m[0m target_health_state {}
    }

[1m  # aws_route53_record.back[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "back" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "back.stagnum.net"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = (known after apply)
    }

[1m  # aws_route53_record.main[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "main" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "stagnum.net"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = (known after apply)
    }

[1m  # aws_route53_record.www[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "www" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "www.stagnum.net"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = (known after apply)
    }

[1m  # aws_route53_zone.primary[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_zone" "primary" {
      [32m+[0m[0m arn                 = (known after apply)
      [32m+[0m[0m comment             = "Managed by Terraform"
      [32m+[0m[0m force_destroy       = false
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "stagnum.net"
      [32m+[0m[0m name_servers        = (known after apply)
      [32m+[0m[0m primary_name_server = (known after apply)
      [32m+[0m[0m tags_all            = (known after apply)
      [32m+[0m[0m zone_id             = (known after apply)
    }

[1m  # aws_security_group.aws-lb_security_group[0m will be [1m[31mdestroyed[0m
  # (because aws_security_group.aws-lb_security_group is not in configuration)
[0m  [31m-[0m[0m resource "aws_security_group" "aws-lb_security_group" {
      [31m-[0m[0m arn                    = "arn:aws:ec2:eu-north-1:851725292587:security-group/sg-0933e7f0a352c9ba0" [90m-> null[0m[0m
      [31m-[0m[0m description            = "Managed by Terraform" [90m-> null[0m[0m
      [31m-[0m[0m egress                 = [
          [31m-[0m[0m {
              [31m-[0m[0m cidr_blocks      = [
                  [31m-[0m[0m "0.0.0.0/0",
                ]
              [31m-[0m[0m description      = ""
              [31m-[0m[0m from_port        = 0
              [31m-[0m[0m ipv6_cidr_blocks = []
              [31m-[0m[0m prefix_list_ids  = []
              [31m-[0m[0m protocol         = "-1"
              [31m-[0m[0m security_groups  = []
              [31m-[0m[0m self             = false
              [31m-[0m[0m to_port          = 0
            },
        ] [90m-> null[0m[0m
      [31m-[0m[0m id                     = "sg-0933e7f0a352c9ba0" [90m-> null[0m[0m
      [31m-[0m[0m ingress                = [
          [31m-[0m[0m {
              [31m-[0m[0m cidr_blocks      = [
                  [31m-[0m[0m "0.0.0.0/0",
                ]
              [31m-[0m[0m description      = ""
              [31m-[0m[0m from_port        = 80
              [31m-[0m[0m ipv6_cidr_blocks = []
              [31m-[0m[0m prefix_list_ids  = []
              [31m-[0m[0m protocol         = "tcp"
              [31m-[0m[0m security_groups  = []
              [31m-[0m[0m self             = false
              [31m-[0m[0m to_port          = 80
            },
        ] [90m-> null[0m[0m
      [31m-[0m[0m name                   = "terraform-20240415210258116900000001" [90m-> null[0m[0m
      [31m-[0m[0m name_prefix            = "terraform-" [90m-> null[0m[0m
      [31m-[0m[0m owner_id               = "851725292587" [90m-> null[0m[0m
      [31m-[0m[0m revoke_rules_on_delete = false [90m-> null[0m[0m
      [31m-[0m[0m tags                   = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all               = {} [90m-> null[0m[0m
      [31m-[0m[0m vpc_id                 = "vpc-059787243b0515c01" [90m-> null[0m[0m
    }

[1m  # aws_security_group.aws-service_security_group[0m will be [1m[31mdestroyed[0m
  # (because aws_security_group.aws-service_security_group is not in configuration)
[0m  [31m-[0m[0m resource "aws_security_group" "aws-service_security_group" {
      [31m-[0m[0m arn                    = "arn:aws:ec2:eu-north-1:851725292587:security-group/sg-0a133d706c3dfec36" [90m-> null[0m[0m
      [31m-[0m[0m description            = "Managed by Terraform" [90m-> null[0m[0m
      [31m-[0m[0m egress                 = [
          [31m-[0m[0m {
              [31m-[0m[0m cidr_blocks      = [
                  [31m-[0m[0m "0.0.0.0/0",
                ]
              [31m-[0m[0m description      = ""
              [31m-[0m[0m from_port        = 0
              [31m-[0m[0m ipv6_cidr_blocks = []
              [31m-[0m[0m prefix_list_ids  = []
              [31m-[0m[0m protocol         = "-1"
              [31m-[0m[0m security_groups  = []
              [31m-[0m[0m self             = false
              [31m-[0m[0m to_port          = 0
            },
        ] [90m-> null[0m[0m
      [31m-[0m[0m id                     = "sg-0a133d706c3dfec36" [90m-> null[0m[0m
      [31m-[0m[0m ingress                = [
          [31m-[0m[0m {
              [31m-[0m[0m cidr_blocks      = []
              [31m-[0m[0m description      = ""
              [31m-[0m[0m from_port        = 0
              [31m-[0m[0m ipv6_cidr_blocks = []
              [31m-[0m[0m prefix_list_ids  = []
              [31m-[0m[0m protocol         = "-1"
              [31m-[0m[0m security_groups  = [
                  [31m-[0m[0m "sg-0933e7f0a352c9ba0",
                ]
              [31m-[0m[0m self             = false
              [31m-[0m[0m to_port          = 0
            },
        ] [90m-> null[0m[0m
      [31m-[0m[0m name                   = "terraform-20240415210302135500000003" [90m-> null[0m[0m
      [31m-[0m[0m name_prefix            = "terraform-" [90m-> null[0m[0m
      [31m-[0m[0m owner_id               = "851725292587" [90m-> null[0m[0m
      [31m-[0m[0m revoke_rules_on_delete = false [90m-> null[0m[0m
      [31m-[0m[0m tags                   = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all               = {} [90m-> null[0m[0m
      [31m-[0m[0m vpc_id                 = "vpc-059787243b0515c01" [90m-> null[0m[0m
    }

[1m  # aws_volume_attachment.this[0m will be created
[0m  [32m+[0m[0m resource "aws_volume_attachment" "this" {
      [32m+[0m[0m device_name = "/dev/sdd"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m instance_id = (known after apply)
      [32m+[0m[0m volume_id   = (known after apply)
    }

[1m  # module.ec2_instance.data.aws_partition.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_partition" "current" {
      [32m+[0m[0m dns_suffix         = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m partition          = (known after apply)
      [32m+[0m[0m reverse_dns_prefix = (known after apply)
    }

[1m  # module.ec2_instance.aws_instance.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "this" {
      [32m+[0m[0m ami                                  = "ami-0b15dce563b217be3"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = true
      [32m+[0m[0m availability_zone                    = "eu-north-1a"
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = "route53_ec2_modify"
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t3.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "deployer-key"
      [32m+[0m[0m monitoring                           = true
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-stack"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-stack"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = (sensitive value)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = true
      [32m+[0m[0m volume_tags                          = {
          [32m+[0m[0m "Name" = "Stagnum-stack"
        }
      [32m+[0m[0m vpc_security_group_ids               = (known after apply)

      [32m+[0m[0m credit_specification {}

      [32m+[0m[0m enclave_options {
          [32m+[0m[0m enabled = (known after apply)
        }

      [32m+[0m[0m metadata_options {
          [32m+[0m[0m http_endpoint               = "enabled"
          [32m+[0m[0m http_protocol_ipv6          = "disabled"
          [32m+[0m[0m http_put_response_hop_limit = 1
          [32m+[0m[0m http_tokens                 = "required"
          [32m+[0m[0m instance_metadata_tags      = (known after apply)
        }

      [32m+[0m[0m timeouts {}
    }

[1m  # module.iam_assumable_role.aws_iam_instance_profile.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "this" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m create_date = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "route53_ec2_modify"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m role        = "route53_ec2_modify"
      [32m+[0m[0m tags_all    = (known after apply)
      [32m+[0m[0m unique_id   = (known after apply)
    }

[1m  # module.iam_assumable_role.aws_iam_role.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "this" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = [
                          [32m+[0m[0m "sts:TagSession",
                          [32m+[0m[0m "sts:AssumeRole",
                        ]
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m AWS     = []
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "route53_ec2_modify"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.iam_assumable_role.aws_iam_role_policy_attachment.custom[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "custom" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "route53_ec2_modify"
    }

[1m  # module.iam_policy_from_data_source.aws_iam_policy.policy[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "policy" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m description      = "Edit stagnum zones for let's encrypt"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "route53_ec2_modify"
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "PolicyDescription" = "Policy created using example from data source"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "PolicyDescription" = "Policy created using example from data source"
        }
    }

[1m  # module.security_group.aws_security_group.this_name_prefix[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "this_name_prefix" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Security group for stagnum"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "Stagnum-security-group-"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-security-group"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-security-group"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "10m"
          [32m+[0m[0m delete = "15m"
        }
    }

[1m  # module.security_group.aws_security_group_rule.egress_rules[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "egress_rules" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "All protocols"
      [32m+[0m[0m from_port                = -1
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = [
          [32m+[0m[0m "::/0",
        ]
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = -1
      [32m+[0m[0m type                     = "egress"
    }

[1m  # module.security_group.aws_security_group_rule.ingress_rules[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_rules" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "HTTP"
      [32m+[0m[0m from_port                = 80
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = []
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 80
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_group.aws_security_group_rule.ingress_rules[1][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_rules" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "HTTPS"
      [32m+[0m[0m from_port                = 443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = []
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_group.aws_security_group_rule.ingress_rules[2][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_rules" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "All IPV4 ICMP"
      [32m+[0m[0m from_port                = -1
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = []
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "icmp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = -1
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_group.aws_security_group_rule.ingress_rules[3][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_rules" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "SSH"
      [32m+[0m[0m from_port                = 22
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = []
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 22
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.vpc.aws_default_network_acl.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_default_network_acl" "this" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m default_network_acl_id = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc-default"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc-default"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)

      [32m+[0m[0m egress {
          [32m+[0m[0m action          = "allow"
          [32m+[0m[0m from_port       = 0
          [32m+[0m[0m ipv6_cidr_block = "::/0"
          [32m+[0m[0m protocol        = "-1"
          [32m+[0m[0m rule_no         = 101
          [32m+[0m[0m to_port         = 0
        }
      [32m+[0m[0m egress {
          [32m+[0m[0m action     = "allow"
          [32m+[0m[0m cidr_block = "0.0.0.0/0"
          [32m+[0m[0m from_port  = 0
          [32m+[0m[0m protocol   = "-1"
          [32m+[0m[0m rule_no    = 100
          [32m+[0m[0m to_port    = 0
        }

      [32m+[0m[0m ingress {
          [32m+[0m[0m action          = "allow"
          [32m+[0m[0m from_port       = 0
          [32m+[0m[0m ipv6_cidr_block = "::/0"
          [32m+[0m[0m protocol        = "-1"
          [32m+[0m[0m rule_no         = 101
          [32m+[0m[0m to_port         = 0
        }
      [32m+[0m[0m ingress {
          [32m+[0m[0m action     = "allow"
          [32m+[0m[0m cidr_block = "0.0.0.0/0"
          [32m+[0m[0m from_port  = 0
          [32m+[0m[0m protocol   = "-1"
          [32m+[0m[0m rule_no    = 100
          [32m+[0m[0m to_port    = 0
        }
    }

[1m  # module.vpc.aws_default_route_table.default[0][0m will be created
[0m  [32m+[0m[0m resource "aws_default_route_table" "default" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m default_route_table_id = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m route                  = (known after apply)
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc-default"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc-default"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "5m"
          [32m+[0m[0m update = "5m"
        }
    }

[1m  # module.vpc.aws_default_security_group.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_default_security_group" "this" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = (known after apply)
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc-default"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc-default"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m vpc_id                 = (known after apply)
    }

[1m  # module.vpc.aws_internet_gateway.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_internet_gateway" "this" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m owner_id = (known after apply)
      [32m+[0m[0m tags     = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m vpc_id   = (known after apply)
    }

[1m  # module.vpc.aws_route.public_internet_gateway[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route" "public_internet_gateway" {
      [32m+[0m[0m destination_cidr_block = "0.0.0.0/0"
      [32m+[0m[0m gateway_id             = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_id            = (known after apply)
      [32m+[0m[0m instance_owner_id      = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m origin                 = (known after apply)
      [32m+[0m[0m route_table_id         = (known after apply)
      [32m+[0m[0m state                  = (known after apply)

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "5m"
        }
    }

[1m  # module.vpc.aws_route_table.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table" "public" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m owner_id         = (known after apply)
      [32m+[0m[0m propagating_vgws = (known after apply)
      [32m+[0m[0m route            = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc-public"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc-public"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m vpc_id           = (known after apply)
    }

[1m  # module.vpc.aws_route_table_association.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m route_table_id = (known after apply)
      [32m+[0m[0m subnet_id      = (known after apply)
    }

[1m  # module.vpc.aws_subnet.public[0][0m will be created
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m[0m arn                                            = (known after apply)
      [32m+[0m[0m assign_ipv6_address_on_creation                = false
      [32m+[0m[0m availability_zone                              = "eu-north-1a"
      [32m+[0m[0m availability_zone_id                           = (known after apply)
      [32m+[0m[0m cidr_block                                     = "10.0.1.0/24"
      [32m+[0m[0m enable_dns64                                   = false
      [32m+[0m[0m enable_resource_name_dns_a_record_on_launch    = false
      [32m+[0m[0m enable_resource_name_dns_aaaa_record_on_launch = false
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_association_id                 = (known after apply)
      [32m+[0m[0m ipv6_native                                    = false
      [32m+[0m[0m map_public_ip_on_launch                        = false
      [32m+[0m[0m owner_id                                       = (known after apply)
      [32m+[0m[0m private_dns_hostname_type_on_launch            = (known after apply)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc-public-eu-north-1a"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                                       = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc-public-eu-north-1a"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m vpc_id                                         = (known after apply)
    }

[1m  # module.vpc.aws_vpc.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_vpc" "this" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m cidr_block                           = "10.0.0.0/16"
      [32m+[0m[0m default_network_acl_id               = (known after apply)
      [32m+[0m[0m default_route_table_id               = (known after apply)
      [32m+[0m[0m default_security_group_id            = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = true
      [32m+[0m[0m enable_dns_support                   = true
      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = "default"
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Environment" = "Prod"
          [32m+[0m[0m "Name"        = "Stagnum-vpc"
          [32m+[0m[0m "Project"     = "Stagnum"
          [32m+[0m[0m "Service"     = "Stagnum"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1mPlan:[0m 27 to add, 0 to change, 20 to destroy.
[0m
Changes to Outputs:
  [31m-[0m[0m back_lb_dns     = "stagnum-back-lb-1793228185.eu-north-1.elb.amazonaws.com" [90m-> null[0m[0m
  [32m+[0m[0m dns_nameservers = (known after apply)
  [32m+[0m[0m ec2_eip         = (known after apply)
  [32m+[0m[0m ec2_public_dns  = (known after apply)
  [31m-[0m[0m front_lb_dns    = "stagnum-front-lb-281869962.eu-north-1.elb.amazonaws.com" [90m-> null[0m[0m
```
</details>